Ran Plan for 2 projects:

1. dir: `terraform-aws` workspace: `default`
1. dir: `terraform-gcp` workspace: `default`

### 1. dir: `terraform-aws` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.web_app will be created
+ resource "aws_instance" "web_app" {
      + ami                                  = "ami-674cbc1e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "m5.7xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = true
          + device_name           = "my_data"
          + encrypted             = (known after apply)
          + iops                  = 800
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 1000
          + volume_type           = "io1"
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # aws_lambda_function.hello_world will be created
+ resource "aws_lambda_function" "hello_world" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "hello_world"
      + handler                        = "exports.test"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:lambda:us-east-1:account-id:resource-id"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


Detected Terraform plan file at /home/atlantis/.atlantis/repos/tim775/atlantis-demo/2/default/terraform-aws/default.tfplan
  [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96;1m⠇[0m Running terraform show   [96;1m⠏[0m Running terraform show   [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96;1m⠇[0m Running terraform show   [96;1m⠏[0m Running terraform show   [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96;1m⠇[0m Running terraform show   [96;1m⠏[0m Running terraform show   [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96;1m⠇[0m Running terraform show   [96;1m⠏[0m Running terraform show   [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96;1m⠧[0m Running terraform show   [96;1m⠇[0m Running terraform show   [96;1m⠏[0m Running terraform show   [96;1m⠋[0m Running terraform show   [96;1m⠙[0m Running terraform show   [96;1m⠹[0m Running terraform show   [96;1m⠸[0m Running terraform show   [96;1m⠼[0m Running terraform show   [96;1m⠴[0m Running terraform show   [96;1m⠦[0m Running terraform show   [96m✔[0m Running terraform show
  [96;1m⠋[0m Calculating monthly cost estimate   [96;1m⠙[0m Calculating monthly cost estimate   [96;1m⠹[0m Calculating monthly cost estimate   [96;1m⠸[0m Calculating monthly cost estimate   [96;1m⠼[0m Calculating monthly cost estimate   [96;1m⠴[0m Calculating monthly cost estimate   [96m✔[0m Calculating monthly cost estimate

Output saved to /tmp/tim775-atlantis-demo-2-default-terraform-aws-infracost.json

Output saved to /tmp/comment.md

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0{
  "url": "https://api.github.com/repos/tim775/atlantis-demo/issues/comments/1011353522",
  "html_url": "https://github.com/tim775/atlantis-demo/pull/2#issuecomment-1011353522",
  "issue_url": "https://api.github.com/repos/tim775/atlantis-demo/issues/2",
  "id": 1011353522,
  "node_id": "IC_kwDOGn6zkc48SAey",
  "user": {
    "login": "tim775",
    "id": 52185,
    "node_id": "MDQ6VXNlcjUyMTg1",
    "avatar_url": "https://avatars.githubusercontent.com/u/52185?u=238f4496bfe2f2b638b102b4094b0816e808b2cd&v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/tim775",
    "html_url": "https://github.com/tim775",
    "followers_url": "https://api.github.com/users/tim775/followers",
    "following_url": "https://api.github.com/users/tim775/following{/other_user}",
    "gists_url": "https://api.github.com/users/tim775/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/tim775/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/tim775/subscriptions",
    "organizations_url": "https://api.github.com/users/tim775/orgs",
    "repos_url": "https://api.github.com/users/tim775/repos",
    "events_url": "https://api.github.com/users/tim775/events{/privacy}",
    "received_events_url": "https://api.github.com/users/tim775/received_events",
    "type": "User",
    "site_admin": false
  },
  "created_at": "2022-01-12T18:54:02Z",
  "updated_at": "2022-01-12T18:54:02Z",
  "a100  1820  100  1797  100    23   2361     30 --:--:-- --:--:-- --:--:--  2439
uthor_association": "OWNER",
  "body": "Infracomment",
  "reactions": {
    "url": "https://api.github.com/repos/tim775/atlantis-demo/issues/comments/1011353522/reactions",
    "total_count": 0,
    "+1": 0,
    "-1": 0,
    "laugh": 0,
    "hooray": 0,
    "confused": 0,
    "heart": 0,
    "rocket": 0,
    "eyes": 0
  },
  "performed_via_github_app": null
}

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-aws`
* :put_litter_in_its_place: To **delete** this plan click [here](http://def486c5c2ac:4141/lock?id=tim775%252Fatlantis-demo%252Fterraform-aws%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-aws`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terraform-gcp` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/tim775/atlantis-demo/2/default/terraform-gcp": exit status 1

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/google...
- Using hashicorp/google v4.6.0 from the shared cache directory
Provider installation was canceled by an interrupt signal.

```

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
